import { TrashBin } from "../models/ITrashBin";

export const mockTrashBins: TrashBin[] = [
    {
        id: 'bin1',
        location: '95/11 ถ. อโศก - ดินแดง แขวงสามเสนใน เขตพญาไท กรุงเทพมหานคร 10400',
        fillLevel: 81,
        coordinates: [13.767208513234314, 100.5463666515701],
    },
    {
        id: 'bin2',
        location: '1-17 ซอย อนุสรณ์ 1 แขวงวัดเทพศิรินทร์ เขตป้อมปราบศัตรูพ่าย กรุงเทพมหานคร 10100',
        fillLevel: 45,
        coordinates: [13.748587582907566, 100.51447853609925],
    },
    {
        id: 'bin3',
        location: 'ถ. มหาจักร แขวงสัมพันธวงศ์ เขตสัมพันธวงศ์ กรุงเทพมหานคร 10100',
        fillLevel: 90,
        coordinates: [13.74423740570776, 100.50579689220605],
    },
    {
        id: 'bin4',
        location: '69-143 ถ. ดินสอ แขวงวัดบวรนิเวศ เขตพระนคร กรุงเทพมหานคร 10200',
        fillLevel: 60,
        coordinates: [13.75803404106256, 100.502221373574],
    },
    {
        id: 'bin5',
        location: '134-44 ถนน ราชดำเนินกลาง แขวงวัดบวรนิเวศ เขตพระนคร กรุงเทพมหานคร 10200',
        fillLevel: 20,
        coordinates: [13.757082744490637, 100.49938559405923],
    },
];